---
kind: method
id: M:Autodesk.Revit.DB.ElementIntersectsSolidFilter.GetSolid
source: html/b2edbeab-be17-6642-5b75-bbb2d016df97.htm
---
# Autodesk.Revit.DB.ElementIntersectsSolidFilter.GetSolid Method

Gets the target solid geometry.

## Syntax (C#)
```csharp
public Solid GetSolid()
```

## Returns
The solid geometry.